InformationRegisters/упПравилаВыполненияРейсаВМобильномКлиенте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПравилаВыполненияРейсаВМобильномКлиенте</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РазрешеноИзменятьПорядокТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОтменятьНовыеТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоОднаТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияПодтвержденияНовыхТочек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОтправкиКоординат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОпределенияМестоположения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыОпределенияМестоположения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНавигатора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыНавигаторов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереводитьРейсВСтатусВыполняетсяПослеПрибытияВПервуюТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВыводаИнформацииОПолучателе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыВыводаИнформацииОПолучателе</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяРозничнаяПродажаВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенаНастройкаКассовогоОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗакрыватьКассовуюСменуПослеВыполненияРейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКассовойТехники</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыВыбораВидовКассовойТехники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассаККМПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКассыККМ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАдресаСклада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешеноОтложенноеВыполнениеЧастиРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот</Name>
					<Comment>Вид доступа для действия "Отложенное выполнение части работ"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыДоступаДействийМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаТиповСобытийМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГруппыТиповСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОтветовОтложенноеВыполнениеЧастиРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатураДляАвансов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНоменклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДСДляАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьАвтозаполнениеРасчетныхПолейПередПробитиемЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВариантыВыбораВидовКассовойТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВариантыВыбораВидовКассовойТехники</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АТОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IBOX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/упПравилаВыполненияРейсаВМобильномКлиенте/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ТолькоПросмотр Тогда 
		Если Запись.ПериодичностьОтправкиКоординат = 0 Тогда 
			Запись.ПериодичностьОтправкиКоординат = 60;
		КонецЕсли;	
		Если Запись.ВремяОжиданияПодтвержденияНовыхТочек = 0 Тогда 
			Запись.ВремяОжиданияПодтвержденияНовыхТочек = 300;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Истина
		И Запись.ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах
		И Не ЗначениеЗаполнено(Запись.ВидАдресаСклада)
	Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнено поле ""Вид адреса склада""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ВидАдресаСклада",	"Запись",	Отказ);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РазрешеноИзменятьПорядокТочекПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОднаТочкаПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноОтменятьНовыеТочкиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВедетсяРозничнаяПродажаВРейсеПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКассовойТехникиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноОтложенноеВыполнениеЧастиРаботПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()

	Элементы.РазрешеноИзменятьПорядокТочек.Доступность                    = НЕ Запись.ТолькоОднаТочка;
	Элементы.ТолькоОднаТочка.Доступность                                  = НЕ Запись.РазрешеноИзменятьПорядокТочек;
	Элементы.ВремяОжиданияПодтвержденияНовыхТочек.Доступность             = Запись.РазрешеноОтменятьНовыеТочки;
	Элементы.РазрешенаНастройкаКассовогоОборудования.Доступность          = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.ЗакрыватьКассовуюСменуПослеВыполненияРейса.Доступность       = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.ВидКассовойТехники.Доступность                               = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.КассаККМПоУмолчанию.Доступность                              = (Запись.ВедетсяРозничнаяПродажаВРейсе И Не Запись.ВидКассовойТехники = ПредопределенноеЗначение("Перечисление.упВариантыВыбораВидовКассовойТехники.АТОЛ"));
	Элементы.ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот.Доступность = Запись.РазрешеноОтложенноеВыполнениеЧастиРабот;
	
КонецПроцедуры

#КонецОбласти
